Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M261_v1.svd
       <register derivedFrom="SYS_GPA_MFOS">
          <name>SYS_GPB_MFOS</name>
          <displayName>SYS_GPB_MFOS</displayName>
          <description>GPIOB Multiple Function Output Select Register</description>
          <addressOffset>0x84</addressOffset>
       </register>
       <register derivedFrom="SYS_GPA_MFOS">
          <name>SYS_GPC_MFOS</name>
          <displayName>SYS_GPC_MFOS</displayName>
          <description>GPIOC Multiple Function Output Select Register</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register derivedFrom="SYS_GPA_MFOS">
          <name>SYS_GPD_MFOS</name>
          <displayName>SYS_GPD_MFOS</displayName>
          <description>GPIOD Multiple Function Output Select Register</description>
          <addressOffset>0x8C</addressOffset>
       </register>
       <register derivedFrom="SYS_GPA_MFOS">
          <name>SYS_GPE_MFOS</name>
          <displayName>SYS_GPE_MFOS</displayName>
          <description>GPIOE Multiple Function Output Select Register</description>
          <addressOffset>0x90</addressOffset>
       </register>
       <register derivedFrom="SYS_GPA_MFOS">
          <name>SYS_GPF_MFOS</name>
          <displayName>SYS_GPF_MFOS</displayName>
          <description>GPIOF Multiple Function Output Select Register</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register derivedFrom="SYS_GPA_MFOS">
          <name>SYS_GPG_MFOS</name>
          <displayName>SYS_GPG_MFOS</displayName>
          <description>GPIOG Multiple Function Output Select Register</description>
          <addressOffset>0x98</addressOffset>
       </register>
       <register derivedFrom="SYS_GPA_MFOS">
          <name>SYS_GPH_MFOS</name>
          <displayName>SYS_GPH_MFOS</displayName>
          <description>GPIOH Multiple Function Output Select Register</description>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register>
          <name>SYS_SRAMICTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_SRAMICTL</displayName>
          <description>System SRAM Interrupt Enable Control Register</description>
          <addressOffset>0xC0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PERRIEN</name>
              <description>SRAM Parity Check Error Interrupt Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SRAM parity check error interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SRAM parity check error interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_SRAMSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_SRAMSTS</displayName>
          <description>System SRAM Parity Error Status Register</description>
          <addressOffset>0xC4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PERRIF</name>
              <description>SRAM Parity Check Error Flag\nThis bit indicates the System SRAM parity error occurred. Write 1 to clear this to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No System SRAM parity error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM parity error occur</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_SRAMEADR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_SRAMEADR</displayName>
          <description>System SRAM Parity Check Error Address Register</description>
          <addressOffset>0xC8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERRADDR</name>
              <description>System SRAM Parity Error Address\nThis register shows system SRAM parity error byte address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_SRAMPCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_SRAMPCTL</displayName>
          <description>System SRAM Power Mode Control Register</description>
          <addressOffset>0xDC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STACK</name>
              <description>System SRAM Stack Position (Write Protect)\nThis field must configure the system SRAM marco that first SRAM address accessed by CPU in power-on process.\nNote: These bits are write protected. Refer to the SYS_REGLCTL register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RETCNT</name>
              <description>SRAM Retention Count (Write Protect)\nThis field can configure SRAM marco retention time in unit of HIRC period.\nNote: These bits are write protected. Refer to the SYS_REGLCTL register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>one HIRC period</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>two HIRC periods</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>three HIRC periods</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>four HIRC periods</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM0PM0</name>
              <description>Bank0 SRAM Power Mode Select 0 (Write Protect)\nThis field can control bank0 SRAM (32 KB) power mode when system enters Power-down mode for range 0x2000_0000 - 0x2000_1FFF.\nNote1: Bank 0 SRAM is always operating in power shut down mode for system enter Deep Power-down Mode (DPD).\nNote2: These bits are write protected. Refer to the SYS_REGLCTL register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM0PM1</name>
              <description>Bank0 SRAM Power Mode Select 1 (Write Protect)\nThis field can control bank0 sram (32k) power mode when system enters Power-down mode for range 0x2000_2000 - 0x2000_3FFF.\nNote1: Bank 0 SRAM is always operating in power shut down mode for system enter Deep Power-down Mode (DPD).\nNote2: These bits are write protected. Refer to the SYS_REGLCTL register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM0PM2</name>
              <description>Bank0 SRAM Power Mode Select 2 (Write Protect)\nThis field can control bank0 SRAM (32 KB) power mode when system enters Power-down mode for range 0x2004_0000 - 0x2000_5FFF.\nNote1: Bank 0 SRAM is always operating in power shut down mode for system enter Deep Power-down Mode (DPD).\nNote2: These bits are write protected. Refer to the SYS_REGLCTL register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM0PM3</name>
              <description>Bank0 SRAM Power Mode Select 3 (Write Protect)\nThis field can control bank0 SRAM (32 KB) power mode when system enters Power-down mode for range 0x2006_0000 - 0x2000_7FFF.\nNote1: Bank 0 SRAM is always operating in power shut down mode for system enter Deep Power-down Mode (DPD).\nNote2: These bits are write protected. Refer to the SYS_REGLCTL register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1PM0</name>
              <description>Bank1 SRAM Power Mode Select 0 (Write Protect)\nThis field can control bank1 SRAM (64 KB) power mode when system enters Power-down mode for range 0x2000_8000 - 0x2000_BFFF.\nNote1: Bank 1 SRAM is always operating in power shut down mode for system enter StandbyPower-down Mode (SPD) and Deep Power-down Mode (DPD). \nNote2: These bits are write protected. Refer to the SYS_REGLCTL register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1PM1</name>
              <description>Bank1 SRAM Power Mode Select 1 (Write Protect)\nThis field can control bank1 SRAM (64 KB) power mode when system enters Power-down mode for range 0x2000_C000 - 0x2000_FFFF.\nNote1: Bank 1 SRAM is always operating in power shut down mode for system enter StandbyPower-down Mode (SPD) and Deep Power-down Mode (DPD).\nNote2: These bits are write protected. Refer to the SYS_REGLCTL register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1PM2</name>
              <description>Bank1 SRAM Power Mode Select 2 (Write Protect)\nThis field can control bank1 SRAM (64 KB) power mode when system enters Power-down mode for range 0x2001_0000 - 0x2001_3FFF.\nNote1: Bank 1 SRAM is always operating in power shut down mode for system enter Standby Power-down Mode (SPD) and Deep Power-down Mode (DPD).\nNote2: These bits are write protected. Refer to the SYS_REGLCTL register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1PM3</name>
              <description>Bank1 SRAM Power Mode Select 3 (Write Protect)\nThis field can control bank1 SRAM (64 KB) power mode when system enters Power-down mode for range 0x2001_4000 - 0x2001_7FFF.\nNote1: Bank 1 SRAM is always operating in power shut down mode for system enter Standby Power-down Mode (SPD) and Deep Power-down Mode (DPD).\nNote2: These bits are write protected. Refer to the SYS_REGLCTL register.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
