Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M261_v1.svd
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD7</name>
          <displayName>USBD_MXPLD7</displayName>
          <description>Endpoint 7 Maximal Payload Register</description>
          <addressOffset>0x574</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG7</name>
          <displayName>USBD_CFG7</displayName>
          <description>Endpoint 7 Configuration Register</description>
          <addressOffset>0x578</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP7</name>
          <displayName>USBD_CFGP7</displayName>
          <description>Endpoint 7 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x57C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG8</name>
          <displayName>USBD_BUFSEG8</displayName>
          <description>Endpoint 8 Buffer Segmentation Register</description>
          <addressOffset>0x580</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD8</name>
          <displayName>USBD_MXPLD8</displayName>
          <description>Endpoint 8 Maximal Payload Register</description>
          <addressOffset>0x584</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG8</name>
          <displayName>USBD_CFG8</displayName>
          <description>Endpoint 8 Configuration Register</description>
          <addressOffset>0x588</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP8</name>
          <displayName>USBD_CFGP8</displayName>
          <description>Endpoint 8 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x58C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG9</name>
          <displayName>USBD_BUFSEG9</displayName>
          <description>Endpoint 9 Buffer Segmentation Register</description>
          <addressOffset>0x590</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD9</name>
          <displayName>USBD_MXPLD9</displayName>
          <description>Endpoint 9 Maximal Payload Register</description>
          <addressOffset>0x594</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG9</name>
          <displayName>USBD_CFG9</displayName>
          <description>Endpoint 9 Configuration Register</description>
          <addressOffset>0x598</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP9</name>
          <displayName>USBD_CFGP9</displayName>
          <description>Endpoint 9 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x59C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG10</name>
          <displayName>USBD_BUFSEG10</displayName>
          <description>Endpoint 10 Buffer Segmentation Register</description>
          <addressOffset>0x5A0</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD10</name>
          <displayName>USBD_MXPLD10</displayName>
          <description>Endpoint 10 Maximal Payload Register</description>
          <addressOffset>0x5A4</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG10</name>
          <displayName>USBD_CFG10</displayName>
          <description>Endpoint 10 Configuration Register</description>
          <addressOffset>0x5A8</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP10</name>
          <displayName>USBD_CFGP10</displayName>
          <description>Endpoint 10 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x5AC</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG11</name>
          <displayName>USBD_BUFSEG11</displayName>
          <description>Endpoint 11 Buffer Segmentation Register</description>
          <addressOffset>0x5B0</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD11</name>
          <displayName>USBD_MXPLD11</displayName>
          <description>Endpoint 11 Maximal Payload Register</description>
          <addressOffset>0x5B4</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG11</name>
          <displayName>USBD_CFG11</displayName>
          <description>Endpoint 11 Configuration Register</description>
          <addressOffset>0x5B8</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP11</name>
          <displayName>USBD_CFGP11</displayName>
          <description>Endpoint 11 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x5BC</addressOffset>
       </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USBH</name>
      <description>USBH Register Map</description>
      <groupName>USBH</groupName>
      <baseAddress>0x40009000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x58</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x200</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>HcRevision</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>HcRevision</displayName>
          <description>Host Controller Revision Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000110</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REV</name>
              <description>Revision Number\nIndicates the Open HCI Specification revision number implemented by the Hardware. Host Controller supports 1.1 specification.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>HcControl</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>HcControl</displayName>
          <description>Host Controller Control Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBSR</name>
              <description>Control Bulk Service Ratio\nThis specifies the service ratio between Control and Bulk EDs. Before processing any of the non-periodic lists, HC must compare the ratio specified with its internal count on how many nonempty Control EDs have been processed, in determining whether to continue serving another Control ED or switching to Bulk EDs. The internal count will be retained when crossing the frame boundary. In case of reset, HCD is responsible for restoring this\nValue.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Number of Control EDs over Bulk EDs served is 1:1</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Number of Control EDs over Bulk EDs served is 2:1</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Number of Control EDs over Bulk EDs served is 3:1</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Number of Control EDs over Bulk EDs served is 4:1</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PLE</name>
              <description>Periodic List Enable Bit\nWhen set, this bit enables processing of the Periodic (interrupt and isochronous) list. The Host Controller checks this bit prior to attempting any periodic transfers in a frame.\nNote: To enable the processing of the Isochronous list, user has to set both PLE  and IE (HcControl[3]) high.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Processing of the Periodic (Interrupt and Isochronous) list after next SOF (Start-Of-Frame) Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Processing of the Periodic (Interrupt and Isochronous) list in the next frame Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>Isochronous List Enable Bit\nBoth ISOEn and PLE (HcControl[2]) high enables Host Controller to process the Isochronous list. Either ISOEn or PLE (HcControl[2]) is low disables Host Controller to process the Isochronous list.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Processing of the Isochronous list after next SOF (Start-Of-Frame) Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Processing of the Isochronous list in the next frame Enabled, if the PLE (HcControl[2]) is high, too</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CLE</name>
              <description>Control List Enable Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Processing of the Control list after next SOF (Start-Of-Frame) Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Processing of the Control list in the next frame Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE</name>
              <description>Bulk List Enable Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Processing of the Bulk list after next SOF (Start-Of-Frame) Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Processing of the Bulk list in the next frame Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HCFS</name>
              <description>Host Controller Functional State\nThis field sets the Host Controller state. The Controller may force a state change from USBSUSPEND to USBRESUME after detecting resume signaling from a downstream port. States are:</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>USBSUSPEND</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>USBOPERATIONAL</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>USBRESUME</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>USBRESET</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>HcCommandStatus</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>HcCommandStatus</displayName>
          <description>Host Controller Command Status Register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HCR</name>
              <description>Host Controller Reset\nThis bit is set to initiate the software reset of Host Controller. This bit is cleared by the Host Controller, upon completed of the reset operation.\nThis bit, when set, didn't reset the Root Hub and no subsequent reset signaling be asserted to its downstream ports.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Host Controller is not in software reset state</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Host Controller is in software reset state</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CLF</name>
              <description>Control List Filled\nSet high to indicate there is an active TD on the Control List. It may be set by either software or the Host Controller and cleared by the Host Controller each time it begins processing the head of the Control List.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No active TD found or Host Controller begins to process the head of the Control list</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>An active TD added or found on the Control list</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BLF</name>
              <description>Bulk List Filled\nSet high to indicate there is an active TD on the Bulk list. This bit may be set by either software or the Host Controller and cleared by the Host Controller each time it begins processing the head of the Bulk list.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No active TD found or Host Controller begins to process the head of the Bulk list</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>An active TD added or found on the Bulk list</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SOC</name>
              <description>Schedule Overrun Count\nThese bits are incremented on each scheduling overrun error. It is initialized to 00b and wraps around at 11b. This will be incremented when a scheduling overrun is detected even if SO (HcInterruptStatus[0]) has already been set.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
