Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M261_v1.svd
       <register derivedFrom="CRYPTO_TDES0_CNT">
          <name>CRYPTO_TDES1_CNT</name>
          <displayName>CRYPTO_TDES1_CNT</displayName>
          <description>TDES/DES Byte Count Register for Channel 1</description>
          <addressOffset>0x270</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES2_KEY1H</name>
          <displayName>CRYPTO_TDES2_KEY1H</displayName>
          <description>TDES/DES Key 1 High Word Register for Channel 2</description>
          <addressOffset>0x288</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES2_KEY1L</name>
          <displayName>CRYPTO_TDES2_KEY1L</displayName>
          <description>TDES/DES Key 1 Low Word Register for Channel 2</description>
          <addressOffset>0x28C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES2_KEY2H</name>
          <displayName>CRYPTO_TDES2_KEY2H</displayName>
          <description>TDES Key 2 High Word Register for Channel 2</description>
          <addressOffset>0x290</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES2_KEY2L</name>
          <displayName>CRYPTO_TDES2_KEY2L</displayName>
          <description>TDES Key 2 Low Word Register for Channel 2</description>
          <addressOffset>0x294</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES2_KEY3H</name>
          <displayName>CRYPTO_TDES2_KEY3H</displayName>
          <description>TDES Key 3 High Word Register for Channel 2</description>
          <addressOffset>0x298</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES2_KEY3L</name>
          <displayName>CRYPTO_TDES2_KEY3L</displayName>
          <description>TDES Key 3 Low Word Register for Channel 2</description>
          <addressOffset>0x29C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_IVH">
          <name>CRYPTO_TDES2_IVH</name>
          <displayName>CRYPTO_TDES2_IVH</displayName>
          <description>TDES/DES Initial Vector High Word Register for Channel 2</description>
          <addressOffset>0x2A0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_IVH">
          <name>CRYPTO_TDES2_IVL</name>
          <displayName>CRYPTO_TDES2_IVL</displayName>
          <description>TDES/DES Initial Vector Low Word Register for Channel 2</description>
          <addressOffset>0x2A4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_SADDR">
          <name>CRYPTO_TDES2_SADDR</name>
          <displayName>CRYPTO_TDES2_SADDR</displayName>
          <description>TDES/DES DMA Source Address Register for Channel 2</description>
          <addressOffset>0x2A8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_DADDR">
          <name>CRYPTO_TDES2_DADDR</name>
          <displayName>CRYPTO_TDES2_DADDR</displayName>
          <description>TDES/DES DMA Destination Address Register for Channel 2</description>
          <addressOffset>0x2AC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_CNT">
          <name>CRYPTO_TDES2_CNT</name>
          <displayName>CRYPTO_TDES2_CNT</displayName>
          <description>TDES/DES Byte Count Register for Channel 2</description>
          <addressOffset>0x2B0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES3_KEY1H</name>
          <displayName>CRYPTO_TDES3_KEY1H</displayName>
          <description>TDES/DES Key 1 High Word Register for Channel 3</description>
          <addressOffset>0x2C8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES3_KEY1L</name>
          <displayName>CRYPTO_TDES3_KEY1L</displayName>
          <description>TDES/DES Key 1 Low Word Register for Channel 3</description>
          <addressOffset>0x2CC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES3_KEY2H</name>
          <displayName>CRYPTO_TDES3_KEY2H</displayName>
          <description>TDES Key 2 High Word Register for Channel 3</description>
          <addressOffset>0x2D0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES3_KEY2L</name>
          <displayName>CRYPTO_TDES3_KEY2L</displayName>
          <description>TDES Key 2 Low Word Register for Channel 3</description>
          <addressOffset>0x2D4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES3_KEY3H</name>
          <displayName>CRYPTO_TDES3_KEY3H</displayName>
          <description>TDES Key 3 High Word Register for Channel 3</description>
          <addressOffset>0x2D8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES3_KEY3L</name>
          <displayName>CRYPTO_TDES3_KEY3L</displayName>
          <description>TDES Key 3 Low Word Register for Channel 3</description>
          <addressOffset>0x2DC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_IVH">
          <name>CRYPTO_TDES3_IVH</name>
          <displayName>CRYPTO_TDES3_IVH</displayName>
          <description>TDES/DES Initial Vector High Word Register for Channel 3</description>
          <addressOffset>0x2E0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_IVH">
          <name>CRYPTO_TDES3_IVL</name>
          <displayName>CRYPTO_TDES3_IVL</displayName>
          <description>TDES/DES Initial Vector Low Word Register for Channel 3</description>
          <addressOffset>0x2E4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_SADDR">
          <name>CRYPTO_TDES3_SADDR</name>
          <displayName>CRYPTO_TDES3_SADDR</displayName>
          <description>TDES/DES DMA Source Address Register for Channel 3</description>
          <addressOffset>0x2E8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_DADDR">
          <name>CRYPTO_TDES3_DADDR</name>
          <displayName>CRYPTO_TDES3_DADDR</displayName>
          <description>TDES/DES DMA Destination Address Register for Channel 3</description>
          <addressOffset>0x2EC</addressOffset>
       </register>
