Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M261_v1.svd
       <register derivedFrom="CRYPTO_TDES0_CNT">
          <name>CRYPTO_TDES3_CNT</name>
          <displayName>CRYPTO_TDES3_CNT</displayName>
          <description>TDES/DES Byte Count Register for Channel 3</description>
          <addressOffset>0x2F0</addressOffset>
       </register>
       <register>
          <name>CRYPTO_SHA_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_SHA_CTL</displayName>
          <description>SHA Control Register</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>SHA Engine Start\nNote: This bit is always 0 when it's read back.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start SHA/SHA engine. BUSY flag will be set</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>SHA Engine Stop\nNote: This bit is always 0 when it's read back.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Stop SHA/SHA engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMALAST</name>
              <description>SHA Last Block\nThis bit must be set as feeding in last byte of data.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>SHA Engine DMA Enable Bit\nSHA engine operates in DMA mode, and data movement from/to the engine is done by DMA logic.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHA DMA engine Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SHA DMA engine Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OPMODE</name>
              <description>SHA Engine Operation Modes\n0x0xx: SHA160\n0x100: SHA256\n0x101: SHA224\n0x110: reservedReserved.\n0x111: SHA384</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTSWAP</name>
              <description>SHA Engine Output Data Swap</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Keep the original order</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The order that CPU feeds data to the accelerator will be changed from {byte3, byte2, byte1, byte0} to {byte0, byte1, byte2, byte3}</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INSWAP</name>
              <description>SHA Engine Input Data Swap</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Keep the original order</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The order that CPU feeds data to the accelerator will be changed from {byte3, byte2, byte1, byte0} to {byte0, byte1, byte2, byte3}</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_SHA_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_SHA_STS</displayName>
          <description>SHA Status Flag</description>
          <addressOffset>0x304</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>SHA Engine Busy </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHA/SHA engine is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SHA/SHA engine is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DMABUSY</name>
              <description>SHA Engine DMA Busy Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHA/SHA DMA engine is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SHA/SHA DMA engine is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DMAERR</name>
              <description>SHA Engine DMA Error Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Show the SHA/SHA engine access normal</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Show the SHA/SHA engine access error</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DATINREQ</name>
              <description>SHA Non-dMA Mode Data Input Request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Request SHA/SHA Non-DMA mode data input</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_SHA_DGST0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_SHA_DGST0</displayName>
          <description>SHA Digest Message 0</description>
          <addressOffset>0x308</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DGST</name>
              <description>SHA Digest Message Output Register\nFor SHA-160, the digest is stored in CRYPTO_SHA_DGST0 ~ CRYPTO_SHA_DGST4.\nFor SHA-224, the digest is stored in CRYPTO_SHA_DGST0 ~ CRYPTO_SHA_DGST6.\nFor SHA-256, the digest is stored in CRYPTO_SHA_DGST0 ~ CRYPTO_SHA_DGST7.\nFor SHA-384, the digest is stored in CRYPTO_SHA_DGST0 ~ CRYPTO_SHA_DGST11.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_SHA_DGST0">
          <name>CRYPTO_SHA_DGST1</name>
          <displayName>CRYPTO_SHA_DGST1</displayName>
          <description>SHA Digest Message 1</description>
          <addressOffset>0x30C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_SHA_DGST0">
          <name>CRYPTO_SHA_DGST2</name>
          <displayName>CRYPTO_SHA_DGST2</displayName>
          <description>SHA Digest Message 2</description>
          <addressOffset>0x310</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_SHA_DGST0">
          <name>CRYPTO_SHA_DGST3</name>
          <displayName>CRYPTO_SHA_DGST3</displayName>
          <description>SHA Digest Message 3</description>
          <addressOffset>0x314</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_SHA_DGST0">
          <name>CRYPTO_SHA_DGST4</name>
          <displayName>CRYPTO_SHA_DGST4</displayName>
          <description>SHA Digest Message 4</description>
          <addressOffset>0x318</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_SHA_DGST0">
          <name>CRYPTO_SHA_DGST5</name>
          <displayName>CRYPTO_SHA_DGST5</displayName>
          <description>SHA Digest Message 5</description>
          <addressOffset>0x31C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_SHA_DGST0">
          <name>CRYPTO_SHA_DGST6</name>
          <displayName>CRYPTO_SHA_DGST6</displayName>
          <description>SHA Digest Message 6</description>
          <addressOffset>0x320</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_SHA_DGST0">
          <name>CRYPTO_SHA_DGST7</name>
          <displayName>CRYPTO_SHA_DGST7</displayName>
          <description>SHA Digest Message 7</description>
          <addressOffset>0x324</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_SHA_DGST0">
          <name>CRYPTO_SHA_DGST8</name>
          <displayName>CRYPTO_SHA_DGST8</displayName>
          <description>SHA Digest Message 8</description>
          <addressOffset>0x328</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_SHA_DGST0">
          <name>CRYPTO_SHA_DGST9</name>
          <displayName>CRYPTO_SHA_DGST9</displayName>
          <description>SHA Digest Message 9</description>
          <addressOffset>0x32C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_SHA_DGST0">
          <name>CRYPTO_SHA_DGST10</name>
          <displayName>CRYPTO_SHA_DGST10</displayName>
          <description>SHA Digest Message 10</description>
          <addressOffset>0x330</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_SHA_DGST0">
          <name>CRYPTO_SHA_DGST11</name>
          <displayName>CRYPTO_SHA_DGST11</displayName>
          <description>SHA Digest Message 11</description>
          <addressOffset>0x334</addressOffset>
       </register>
       <register>
          <name>CRYPTO_SHA_KEYCNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_SHA_KEYCNT</displayName>
          <description>SHA Key Byte Count Register</description>
          <addressOffset>0x348</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEYCNT</name>
              <description>SHA Key Byte Count\nThe CRYPTO_SHA_KEYCNT keeps the byte count of key that SHA/SHA engine operates. The register is 32-bit and the maximum byte count is 4G bytes. It can be read and written. \nWriting to the register CRYPTO_SHA_KEYCNT as the SHA/SHA accelerator operating doesn't affect the current SHA/SHA operation. But the value of CRYPTO_SHA _KEYCNT will be updated later on. Consequently, software can prepare the key count for the next SHA/SHA operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_SHA_SADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_SHA_SADDR</displayName>
          <description>SHA DMA Source Address Register</description>
          <addressOffset>0x34C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>SHA DMA Source Address\nThe SHA accelerator supports DMA function to transfer the plain text between SRAM memory space and embedded FIFO. The CRYPTO_SHA_SADDR keeps the source address of the data buffer where the source text is stored. Based on the source address, the SHA accelerator can read the plain text from SRAM memory space and do SHA operation. The start of source address should be located at word boundary. In other words, bit 1 and 0 of CRYPTO_SHA_SADDR are ignored.\nCRYPTO_SHA_SADDR can be read and written. Writing to CRYPTO_SHA_SADDR while the SHA accelerator is operating doesn't affect the current SHA operation. But the value of CRYPTO_SHA_SADDR will be updated later on. Consequently, software can prepare the DMA source address for the next SHA operation.\nIn DMA mode, software can update the next CRYPTO_SHA_SADDR before triggering START.\nCRYPTO_SHA_SADDR and CRYPTO_SHA_DADDR can be the same in the value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_SHA_DMACNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_SHA_DMACNT</displayName>
          <description>SHA Byte Count Register</description>
          <addressOffset>0x350</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMACNT</name>
              <description>SHA Operation Byte Count\nThe CRYPTO_SHA_DMACNT keeps the byte count of source text that is for the SHA engine operating in DMA mode. The CRYPTO_SHA_DMACNT is 32-bit and the maximum of byte count is 4G bytes.\nCRYPTO_SHA_DMACNT can be read and written. Writing to CRYPTO_SHA_DMACNT while the SHA accelerator is operating doesn't affect the current SHA operation. But the value of CRYPTO_SHA_DMACNT will be updated later on. Consequently, software can prepare the byte count of data for the next SHA operation.\nIn Non-DMA mode, CRYPTO_SHA_DMACNT must be set as the byte count of the last block before feeding in the last block of data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_SHA_DATIN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_SHA_DATIN</displayName>
          <description>SHA Engine Non-DMA Mode Data Input Port Register</description>
          <addressOffset>0x354</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATIN</name>
              <description>SHA Engine Input Port\nCPU feeds data to SHA engine through this port by checking CRYPTO_SHA_STS. Feed data as DATINREQ is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
