Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M261_v1.svd
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_03</name>
          <displayName>CRYPTO_ECC_Y1_03</displayName>
          <description>ECC The Y-coordinate word3 of the first point</description>
          <addressOffset>0x85C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_04</name>
          <displayName>CRYPTO_ECC_Y1_04</displayName>
          <description>ECC The Y-coordinate word4 of the first point</description>
          <addressOffset>0x860</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_05</name>
          <displayName>CRYPTO_ECC_Y1_05</displayName>
          <description>ECC The Y-coordinate word5 of the first point</description>
          <addressOffset>0x864</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_06</name>
          <displayName>CRYPTO_ECC_Y1_06</displayName>
          <description>ECC The Y-coordinate word6 of the first point</description>
          <addressOffset>0x868</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_07</name>
          <displayName>CRYPTO_ECC_Y1_07</displayName>
          <description>ECC The Y-coordinate word7 of the first point</description>
          <addressOffset>0x86C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_08</name>
          <displayName>CRYPTO_ECC_Y1_08</displayName>
          <description>ECC The Y-coordinate word8 of the first point</description>
          <addressOffset>0x870</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_09</name>
          <displayName>CRYPTO_ECC_Y1_09</displayName>
          <description>ECC The Y-coordinate word9 of the first point</description>
          <addressOffset>0x874</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_10</name>
          <displayName>CRYPTO_ECC_Y1_10</displayName>
          <description>ECC The Y-coordinate word10 of the first point</description>
          <addressOffset>0x878</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_11</name>
          <displayName>CRYPTO_ECC_Y1_11</displayName>
          <description>ECC The Y-coordinate word11 of the first point</description>
          <addressOffset>0x87C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_12</name>
          <displayName>CRYPTO_ECC_Y1_12</displayName>
          <description>ECC The Y-coordinate word12 of the first point</description>
          <addressOffset>0x880</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_13</name>
          <displayName>CRYPTO_ECC_Y1_13</displayName>
          <description>ECC The Y-coordinate word13 of the first point</description>
          <addressOffset>0x884</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_14</name>
          <displayName>CRYPTO_ECC_Y1_14</displayName>
          <description>ECC The Y-coordinate word14 of the first point</description>
          <addressOffset>0x888</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_15</name>
          <displayName>CRYPTO_ECC_Y1_15</displayName>
          <description>ECC The Y-coordinate word15 of the first point</description>
          <addressOffset>0x88C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_16</name>
          <displayName>CRYPTO_ECC_Y1_16</displayName>
          <description>ECC The Y-coordinate word16 of the first point</description>
          <addressOffset>0x890</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_17</name>
          <displayName>CRYPTO_ECC_Y1_17</displayName>
          <description>ECC The Y-coordinate word17 of the first point</description>
          <addressOffset>0x894</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_X2_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_X2_00</displayName>
          <description>ECC The X-coordinate word0 of the second point</description>
          <addressOffset>0x898</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POINTX2</name>
              <description>ECC the x-coordinate Value of the Second Point (POINTX2)\nFor B-163 or K-163, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_05\nFor B-233 or K-233, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_07\nFor B-283 or K-283, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_08\nFor B-409 or K-409, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_12\nFor B-571 or K-571, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_17\nFor P-192, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_05\nFor P-224, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_06\nFor P-256, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_07\nFor P-384, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_11\nFor P-521, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_01</name>
          <displayName>CRYPTO_ECC_X2_01</displayName>
          <description>ECC The X-coordinate word1 of the second point</description>
          <addressOffset>0x89C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_02</name>
          <displayName>CRYPTO_ECC_X2_02</displayName>
          <description>ECC The X-coordinate word2 of the second point</description>
          <addressOffset>0x8A0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_03</name>
          <displayName>CRYPTO_ECC_X2_03</displayName>
          <description>ECC The X-coordinate word3 of the second point</description>
          <addressOffset>0x8A4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_04</name>
          <displayName>CRYPTO_ECC_X2_04</displayName>
          <description>ECC The X-coordinate word4 of the second point</description>
          <addressOffset>0x8A8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_05</name>
          <displayName>CRYPTO_ECC_X2_05</displayName>
          <description>ECC The X-coordinate word5 of the second point</description>
          <addressOffset>0x8AC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_06</name>
          <displayName>CRYPTO_ECC_X2_06</displayName>
          <description>ECC The X-coordinate word6 of the second point</description>
          <addressOffset>0x8B0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_07</name>
          <displayName>CRYPTO_ECC_X2_07</displayName>
          <description>ECC The X-coordinate word7 of the second point</description>
          <addressOffset>0x8B4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_08</name>
          <displayName>CRYPTO_ECC_X2_08</displayName>
          <description>ECC The X-coordinate word8 of the second point</description>
          <addressOffset>0x8B8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_09</name>
          <displayName>CRYPTO_ECC_X2_09</displayName>
          <description>ECC The X-coordinate word9 of the second point</description>
          <addressOffset>0x8BC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_10</name>
          <displayName>CRYPTO_ECC_X2_10</displayName>
          <description>ECC The X-coordinate word10 of the second point</description>
          <addressOffset>0x8C0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_11</name>
          <displayName>CRYPTO_ECC_X2_11</displayName>
          <description>ECC The X-coordinate word11 of the second point</description>
          <addressOffset>0x8C4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_12</name>
          <displayName>CRYPTO_ECC_X2_12</displayName>
          <description>ECC The X-coordinate word12 of the second point</description>
          <addressOffset>0x8C8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_13</name>
          <displayName>CRYPTO_ECC_X2_13</displayName>
          <description>ECC The X-coordinate word13 of the second point</description>
          <addressOffset>0x8CC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_14</name>
          <displayName>CRYPTO_ECC_X2_14</displayName>
          <description>ECC The X-coordinate word14 of the second point</description>
          <addressOffset>0x8D0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_15</name>
          <displayName>CRYPTO_ECC_X2_15</displayName>
          <description>ECC The X-coordinate word15 of the second point</description>
          <addressOffset>0x8D4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_16</name>
          <displayName>CRYPTO_ECC_X2_16</displayName>
          <description>ECC The X-coordinate word16 of the second point</description>
          <addressOffset>0x8D8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_17</name>
          <displayName>CRYPTO_ECC_X2_17</displayName>
          <description>ECC The X-coordinate word17 of the second point</description>
          <addressOffset>0x8DC</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_Y2_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_Y2_00</displayName>
          <description>ECC The Y-coordinate word0 of the second point</description>
          <addressOffset>0x8E0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POINTY2</name>
              <description>ECC the Y-coordinate Value of the Second Point (POINTY2)\nFor B-163 or K-163, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_05\nFor B-233 or K-233, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_07\nFor B-283 or K-283, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_08\nFor B-409 or K-409, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_12\nFor B-571 or K-571, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_17\nFor P-192, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_05\nFor P-224, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_06\nFor P-256, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_07\nFor P-384, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_11\nFor P-521, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_01</name>
          <displayName>CRYPTO_ECC_Y2_01</displayName>
          <description>ECC The Y-coordinate word1 of the second point</description>
          <addressOffset>0x8E4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_02</name>
          <displayName>CRYPTO_ECC_Y2_02</displayName>
          <description>ECC The Y-coordinate word2 of the second point</description>
          <addressOffset>0x8E8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_03</name>
          <displayName>CRYPTO_ECC_Y2_03</displayName>
          <description>ECC The Y-coordinate word3 of the second point</description>
          <addressOffset>0x8EC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_04</name>
          <displayName>CRYPTO_ECC_Y2_04</displayName>
          <description>ECC The Y-coordinate word4 of the second point</description>
          <addressOffset>0x8F0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_05</name>
          <displayName>CRYPTO_ECC_Y2_05</displayName>
          <description>ECC The Y-coordinate word5 of the second point</description>
          <addressOffset>0x8F4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_06</name>
          <displayName>CRYPTO_ECC_Y2_06</displayName>
          <description>ECC The Y-coordinate word6 of the second point</description>
          <addressOffset>0x8F8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_07</name>
          <displayName>CRYPTO_ECC_Y2_07</displayName>
          <description>ECC The Y-coordinate word7 of the second point</description>
          <addressOffset>0x8FC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_08</name>
          <displayName>CRYPTO_ECC_Y2_08</displayName>
          <description>ECC The Y-coordinate word8 of the second point</description>
          <addressOffset>0x900</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_09</name>
          <displayName>CRYPTO_ECC_Y2_09</displayName>
          <description>ECC The Y-coordinate word9 of the second point</description>
          <addressOffset>0x904</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_10</name>
          <displayName>CRYPTO_ECC_Y2_10</displayName>
          <description>ECC The Y-coordinate word10 of the second point</description>
          <addressOffset>0x908</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_11</name>
          <displayName>CRYPTO_ECC_Y2_11</displayName>
          <description>ECC The Y-coordinate word11 of the second point</description>
          <addressOffset>0x90C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_12</name>
          <displayName>CRYPTO_ECC_Y2_12</displayName>
          <description>ECC The Y-coordinate word12 of the second point</description>
          <addressOffset>0x910</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_13</name>
          <displayName>CRYPTO_ECC_Y2_13</displayName>
          <description>ECC The Y-coordinate word13 of the second point</description>
          <addressOffset>0x914</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_14</name>
          <displayName>CRYPTO_ECC_Y2_14</displayName>
          <description>ECC The Y-coordinate word14 of the second point</description>
          <addressOffset>0x918</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_15</name>
          <displayName>CRYPTO_ECC_Y2_15</displayName>
          <description>ECC The Y-coordinate word15 of the second point</description>
          <addressOffset>0x91C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_16</name>
          <displayName>CRYPTO_ECC_Y2_16</displayName>
          <description>ECC The Y-coordinate word16 of the second point</description>
          <addressOffset>0x920</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_17</name>
          <displayName>CRYPTO_ECC_Y2_17</displayName>
          <description>ECC The Y-coordinate word17 of the second point</description>
          <addressOffset>0x924</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_A_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_A_00</displayName>
          <description>ECC The parameter CURVEA word0 of elliptic curve</description>
          <addressOffset>0x928</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURVEA</name>
              <description>ECC the Parameter CURVEA Value of Elliptic Curve (CURVEA)\nFor B-163 or K-163, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_05\nFor B-233 or K-233, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_07\nFor B-283 or K-283, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_08\nFor B-409 or K-409, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_12\nFor B-571 or K-571, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_17\nFor P-192, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_05\nFor P-224, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_06\nFor P-256, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_07\nFor P-384, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_11\nFor P-521, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_01</name>
          <displayName>CRYPTO_ECC_A_01</displayName>
          <description>ECC The parameter CURVEA word1 of elliptic curve</description>
          <addressOffset>0x92C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_02</name>
          <displayName>CRYPTO_ECC_A_02</displayName>
          <description>ECC The parameter CURVEA word2 of elliptic curve</description>
          <addressOffset>0x930</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_03</name>
          <displayName>CRYPTO_ECC_A_03</displayName>
          <description>ECC The parameter CURVEA word3 of elliptic curve</description>
          <addressOffset>0x934</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_04</name>
          <displayName>CRYPTO_ECC_A_04</displayName>
          <description>ECC The parameter CURVEA word4 of elliptic curve</description>
          <addressOffset>0x938</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_05</name>
          <displayName>CRYPTO_ECC_A_05</displayName>
          <description>ECC The parameter CURVEA word5 of elliptic curve</description>
          <addressOffset>0x93C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_06</name>
          <displayName>CRYPTO_ECC_A_06</displayName>
          <description>ECC The parameter CURVEA word6 of elliptic curve</description>
          <addressOffset>0x940</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_07</name>
          <displayName>CRYPTO_ECC_A_07</displayName>
          <description>ECC The parameter CURVEA word7 of elliptic curve</description>
          <addressOffset>0x944</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_08</name>
          <displayName>CRYPTO_ECC_A_08</displayName>
          <description>ECC The parameter CURVEA word8 of elliptic curve</description>
          <addressOffset>0x948</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_09</name>
          <displayName>CRYPTO_ECC_A_09</displayName>
          <description>ECC The parameter CURVEA word9 of elliptic curve</description>
          <addressOffset>0x94C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_10</name>
          <displayName>CRYPTO_ECC_A_10</displayName>
          <description>ECC The parameter CURVEA word10 of elliptic curve</description>
          <addressOffset>0x950</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_11</name>
          <displayName>CRYPTO_ECC_A_11</displayName>
          <description>ECC The parameter CURVEA word11 of elliptic curve</description>
          <addressOffset>0x954</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_12</name>
          <displayName>CRYPTO_ECC_A_12</displayName>
          <description>ECC The parameter CURVEA word12 of elliptic curve</description>
          <addressOffset>0x958</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_13</name>
          <displayName>CRYPTO_ECC_A_13</displayName>
          <description>ECC The parameter CURVEA word13 of elliptic curve</description>
          <addressOffset>0x95C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_14</name>
          <displayName>CRYPTO_ECC_A_14</displayName>
          <description>ECC The parameter CURVEA word14 of elliptic curve</description>
          <addressOffset>0x960</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_15</name>
          <displayName>CRYPTO_ECC_A_15</displayName>
          <description>ECC The parameter CURVEA word15 of elliptic curve</description>
          <addressOffset>0x964</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_16</name>
          <displayName>CRYPTO_ECC_A_16</displayName>
          <description>ECC The parameter CURVEA word16 of elliptic curve</description>
          <addressOffset>0x968</addressOffset>
       </register>
